JamieZhang97/ILLI-Racecar/Simulink/Lateral Controller/CCS_Simulink/F28379D_IPC_CPU2_2020a_ert_rtw/F28379D_IPC_CPU2_2020a.c
/*
 * File: F28379D_IPC_CPU2_2020a.c
 *
 * Code generated for Simulink model 'F28379D_IPC_CPU2_2020a'.
 *
 * Model version                  : 1.14
 * Simulink Coder version         : 9.3 (R2020a) 18-Nov-2019
 * C/C++ source code generated on : Thu Oct  8 00:59:53 2020
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#include "F28379D_IPC_CPU2_2020a.h"
#include "F28379D_IPC_CPU2_2020a_private.h"

/* Block signals (default storage) */
BlockIO_F28379D_IPC_CPU2_2020a F28379D_IPC_CPU2_2020a_B;

/* Continuous states */
ContinuousStates_F28379D_IPC_CP F28379D_IPC_CPU2_2020a_X;

/* Block states (default storage) */
D_Work_F28379D_IPC_CPU2_2020a F28379D_IPC_CPU2_2020a_DWork;

/* Real-time model */
RT_MODEL_F28379D_IPC_CPU2_2020a F28379D_IPC_CPU2_2020a_M_;
RT_MODEL_F28379D_IPC_CPU2_2020a *const F28379D_IPC_CPU2_2020a_M =
  &F28379D_IPC_CPU2_2020a_M_;
static void rate_monotonic_scheduler(void);

/* Hardware Interrupt Block: '<Root>/IPC Interrupt' */
void isr_int1pie14_task_fcn(void)
{
  /* Call the system: <Root>/IPC 1 */
  {
    /* S-Function (c28xisr_c2000): '<Root>/IPC Interrupt' */

    /* Output and update for function-call system: '<Root>/IPC 1' */

    /* S-Function (c28xipc_rx): '<S1>/IPC Receive1' */
    MW_IPC_Receive(CHANNEL1, (uint32_t *)
                   &F28379D_IPC_CPU2_2020a_B.IPCReceive1_o1[0],
                   &F28379D_IPC_CPU2_2020a_B.IPCReceive1_o2, 4, 8, 0, 0);

    /* End of Outputs for S-Function (c28xisr_c2000): '<Root>/IPC Interrupt' */

    /* RateTransition generated from: '<S3>/Subtract' */
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_Buffer[F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_semapho
      == 0] = F28379D_IPC_CPU2_2020a_B.IPCReceive1_o1[3];
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_ActiveB =
      (F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_semapho == 0);

    /* RateTransition generated from: '<S6>/Subtract' */
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer
      [(F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_semapho == 0) << 1U]
      = F28379D_IPC_CPU2_2020a_B.IPCReceive1_o1[0];
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer[1 +
      ((F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_semapho == 0) << 1U)]
      = F28379D_IPC_CPU2_2020a_B.IPCReceive1_o1[1];
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_ActiveB =
      (F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_semapho == 0);

    /* RateTransition generated from: '<S6>/heading error in [-pi,pi]' */
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInpor[F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInp_p
      == 0] = F28379D_IPC_CPU2_2020a_B.IPCReceive1_o1[2];
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInp_b =
      (F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInp_p == 0);
  }
}

/*
 * Set which subrates need to run this base step (base rate always runs).
 * This function must be called prior to calling the model step function
 * in order to "remember" which rates need to run this base step.  The
 * buffering of events allows for overlapping preemption.
 */
void F28379D_IPC_CPU2_2020a_SetEventsForThisBaseStep(boolean_T *eventFlags)
{
  /* Task runs when its counter is zero, computed via rtmStepTask macro */
  eventFlags[2] = ((boolean_T)rtmStepTask(F28379D_IPC_CPU2_2020a_M, 2));
}

/*
 *   This function updates active task flag for each subrate
 * and rate transition flags for tasks that exchange data.
 * The function assumes rate-monotonic multitasking scheduler.
 * The function must be called at model base rate so that
 * the generated code self-manages all its subrates and rate
 * transition flags.
 */
static void rate_monotonic_scheduler(void)
{
  /* To ensure a deterministic data transfer between two rates,
   * data is transferred at the priority of a fast task and the frequency
   * of the slow task.  The following flags indicate when the data transfer
   * happens.  That is, a rate interaction flag is set true when both rates
   * will run, and false otherwise.
   */

  /* tid 1 shares data with slower tid rate: 2 */
  if (F28379D_IPC_CPU2_2020a_M->Timing.TaskCounters.TID[1] == 0) {
    F28379D_IPC_CPU2_2020a_M->Timing.RateInteraction.TID1_2 =
      (F28379D_IPC_CPU2_2020a_M->Timing.TaskCounters.TID[2] == 0);
  }

  /* Compute which subrates run during the next base time step.  Subrates
   * are an integer multiple of the base rate counter.  Therefore, the subtask
   * counter is reset when it reaches its limit (zero means run).
   */
  (F28379D_IPC_CPU2_2020a_M->Timing.TaskCounters.TID[2])++;
  if ((F28379D_IPC_CPU2_2020a_M->Timing.TaskCounters.TID[2]) > 4) {/* Sample time: [0.005s, 0.0s] */
    F28379D_IPC_CPU2_2020a_M->Timing.TaskCounters.TID[2] = 0;
  }
}

/*
 * This function updates continuous states using the ODE3 fixed-step
 * solver algorithm
 */
static void rt_ertODEUpdateContinuousStates(RTWSolverInfo *si )
{
  /* Solver Matrices */
  static const real_T rt_ODE3_A[3] = {
    1.0/2.0, 3.0/4.0, 1.0
  };

  static const real_T rt_ODE3_B[3][3] = {
    { 1.0/2.0, 0.0, 0.0 },

    { 0.0, 3.0/4.0, 0.0 },

    { 2.0/9.0, 1.0/3.0, 4.0/9.0 }
  };

  time_T t = rtsiGetT(si);
  time_T tnew = rtsiGetSolverStopTime(si);
  time_T h = rtsiGetStepSize(si);
  real_T *x = rtsiGetContStates(si);
  ODE3_IntgData *id = (ODE3_IntgData *)rtsiGetSolverData(si);
  real_T *y = id->y;
  real_T *f0 = id->f[0];
  real_T *f1 = id->f[1];
  real_T *f2 = id->f[2];
  real_T hB[3];
  int_T i;
  int_T nXc = 1;
  rtsiSetSimTimeStep(si,MINOR_TIME_STEP);

  /* Save the state values at time t in y, we'll use x as ynew. */
  (void) memcpy(y, x,
                (uint_T)nXc*sizeof(real_T));

  /* Assumes that rtsiSetT and ModelOutputs are up-to-date */
  /* f0 = f(t,y) */
  rtsiSetdX(si, f0);
  F28379D_IPC_CPU2_2020a_derivatives();

  /* f(:,2) = feval(odefile, t + hA(1), y + f*hB(:,1), args(:)(*)); */
  hB[0] = h * rt_ODE3_B[0][0];
  for (i = 0; i < nXc; i++) {
    x[i] = y[i] + (f0[i]*hB[0]);
  }

  rtsiSetT(si, t + h*rt_ODE3_A[0]);
  rtsiSetdX(si, f1);
  F28379D_IPC_CPU2_2020a_step0();
  F28379D_IPC_CPU2_2020a_derivatives();

  /* f(:,3) = feval(odefile, t + hA(2), y + f*hB(:,2), args(:)(*)); */
  for (i = 0; i <= 1; i++) {
    hB[i] = h * rt_ODE3_B[1][i];
  }

  for (i = 0; i < nXc; i++) {
    x[i] = y[i] + (f0[i]*hB[0] + f1[i]*hB[1]);
  }

