JamieZhang97/ILLI-Racecar/Simulink/Lateral Controller/CCS_Simulink/F28379D_IPC_CPU2_2020a_ert_rtw/F28379D_IPC_CPU2_2020a.c
  rtsiSetT(si, t + h*rt_ODE3_A[1]);
  rtsiSetdX(si, f2);
  F28379D_IPC_CPU2_2020a_step0();
  F28379D_IPC_CPU2_2020a_derivatives();

  /* tnew = t + hA(3);
     ynew = y + f*hB(:,3); */
  for (i = 0; i <= 2; i++) {
    hB[i] = h * rt_ODE3_B[2][i];
  }

  for (i = 0; i < nXc; i++) {
    x[i] = y[i] + (f0[i]*hB[0] + f1[i]*hB[1] + f2[i]*hB[2]);
  }

  rtsiSetT(si, tnew);
  rtsiSetSimTimeStep(si,MAJOR_TIME_STEP);
}

real32_T rt_atan2f_snf(real32_T u0, real32_T u1)
{
  real32_T y;
  int16_T tmp;
  int16_T tmp_0;
  if (rtIsNaNF(u0) || rtIsNaNF(u1)) {
    y = (rtNaNF);
  } else if (rtIsInfF(u0) && rtIsInfF(u1)) {
    if (u1 > 0.0F) {
      tmp = 1;
    } else {
      tmp = -1;
    }

    if (u0 > 0.0F) {
      tmp_0 = 1;
    } else {
      tmp_0 = -1;
    }

    y = (real32_T)atan2(tmp_0, tmp);
  } else if (u1 == 0.0F) {
    if (u0 > 0.0F) {
      y = RT_PIF / 2.0F;
    } else if (u0 < 0.0F) {
      y = -(RT_PIF / 2.0F);
    } else {
      y = 0.0F;
    }
  } else {
    y = (real32_T)atan2(u0, u1);
  }

  return y;
}

/* Model step function for TID0 */
void F28379D_IPC_CPU2_2020a_step0(void) /* Sample time: [0.0s, 0.0s] */
{
  if (rtmIsMajorTimeStep(F28379D_IPC_CPU2_2020a_M)) {
    /* set solver stop time */
    if (!(F28379D_IPC_CPU2_2020a_M->Timing.clockTick0+1)) {
      rtsiSetSolverStopTime(&F28379D_IPC_CPU2_2020a_M->solverInfo,
                            ((F28379D_IPC_CPU2_2020a_M->Timing.clockTickH0 + 1) *
        F28379D_IPC_CPU2_2020a_M->Timing.stepSize0 * 4294967296.0));
    } else {
      rtsiSetSolverStopTime(&F28379D_IPC_CPU2_2020a_M->solverInfo,
                            ((F28379D_IPC_CPU2_2020a_M->Timing.clockTick0 + 1) *
        F28379D_IPC_CPU2_2020a_M->Timing.stepSize0 +
        F28379D_IPC_CPU2_2020a_M->Timing.clockTickH0 *
        F28379D_IPC_CPU2_2020a_M->Timing.stepSize0 * 4294967296.0));
    }

    {                                  /* Sample time: [0.0s, 0.0s] */
      rate_monotonic_scheduler();
    }
  }                                    /* end MajorTimeStep */

  /* Update absolute time of base rate at minor time step */
  if (rtmIsMinorTimeStep(F28379D_IPC_CPU2_2020a_M)) {
    F28379D_IPC_CPU2_2020a_M->Timing.t[0] = rtsiGetT
      (&F28379D_IPC_CPU2_2020a_M->solverInfo);
  }

  /* S-Function (c28xisr_c2000): '<Root>/IPC Interrupt' */
  /* RateTransition generated from: '<Root>/single_array1' */
  if (rtmIsMajorTimeStep(F28379D_IPC_CPU2_2020a_M)) {
    /* RateTransition generated from: '<S3>/Subtract' */
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_semapho =
      F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_ActiveB;
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtSubtractInport1 =
      F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_Buffer[F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_semapho];
    if (F28379D_IPC_CPU2_2020a_M->Timing.RateInteraction.TID1_2) {
      F28379D_IPC_CPU2_2020a_B.TmpRTBAtsingle_array1Inport2 =
        F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtsingle_array1Inport2_Bu;
    }
  }

  /* End of RateTransition generated from: '<Root>/single_array1' */
  /* End of Outputs for S-Function (c28xisr_c2000): '<Root>/IPC Interrupt' */

  /* Sum: '<S3>/Subtract' incorporates:
   *  Constant: '<S3>/DesiredVelocity'
   */
  F28379D_IPC_CPU2_2020a_B.Subtract =
    F28379D_IPC_CPU2_2020a_P.DesiredVelocity_Value -
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtSubtractInport1;

  /* Gain: '<S3>/Kp' */
  F28379D_IPC_CPU2_2020a_B.Kp = F28379D_IPC_CPU2_2020a_P.Kp_Gain *
    F28379D_IPC_CPU2_2020a_B.Subtract;

  /* Integrator: '<S3>/Integrator' */
  F28379D_IPC_CPU2_2020a_B.Integrator =
    F28379D_IPC_CPU2_2020a_X.Integrator_CSTATE;

  /* Gain: '<S3>/Ki' */
  F28379D_IPC_CPU2_2020a_B.Ki = (real32_T)(F28379D_IPC_CPU2_2020a_P.Ki_Gain *
    F28379D_IPC_CPU2_2020a_B.Integrator);

  /* Sum: '<S3>/Subtract1' */
  F28379D_IPC_CPU2_2020a_B.Subtract1 = F28379D_IPC_CPU2_2020a_B.Kp +
    F28379D_IPC_CPU2_2020a_B.Ki;

  /* MATLAB Function: '<Root>/single_array1' incorporates:
   *  Constant: '<Root>/Constant1'
   */
  /* MATLAB Function 'single_array1': '<S7>:1' */
  /* '<S7>:1:3' */
  F28379D_IPC_CPU2_2020a_B.output_array[0] = F28379D_IPC_CPU2_2020a_B.Subtract1;
  F28379D_IPC_CPU2_2020a_B.output_array[1] =
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtsingle_array1Inport2;
  F28379D_IPC_CPU2_2020a_B.output_array[2] = (real32_T)
    F28379D_IPC_CPU2_2020a_P.Constant1_Value;
  F28379D_IPC_CPU2_2020a_B.output_array[3] = (real32_T)
    F28379D_IPC_CPU2_2020a_P.Constant1_Value;

  /* S-Function (c28xipc_tx): '<Root>/IPC Transmit 1' */
  MW_IPC_Transmit(CHANNEL1, (uint32_t *)&F28379D_IPC_CPU2_2020a_B.output_array[0],
                  4, 8, 0, 0);

  /* DataTypeConversion: '<S3>/Data Type Conversion' */
  F28379D_IPC_CPU2_2020a_B.DataTypeConversion =
    F28379D_IPC_CPU2_2020a_B.Subtract;
  if (rtmIsMajorTimeStep(F28379D_IPC_CPU2_2020a_M)) {
    rt_ertODEUpdateContinuousStates(&F28379D_IPC_CPU2_2020a_M->solverInfo);

    /* Update absolute time */
    /* The "clockTick0" counts the number of times the code of this task has
     * been executed. The absolute time is the multiplication of "clockTick0"
     * and "Timing.stepSize0". Size of "clockTick0" ensures timer will not
     * overflow during the application lifespan selected.
     * Timer of this task consists of two 32 bit unsigned integers.
     * The two integers represent the low bits Timing.clockTick0 and the high bits
     * Timing.clockTickH0. When the low bit overflows to 0, the high bits increment.
     */
    if (!(++F28379D_IPC_CPU2_2020a_M->Timing.clockTick0)) {
      ++F28379D_IPC_CPU2_2020a_M->Timing.clockTickH0;
    }

    F28379D_IPC_CPU2_2020a_M->Timing.t[0] = rtsiGetSolverStopTime
      (&F28379D_IPC_CPU2_2020a_M->solverInfo);

    /* Update absolute time */
    /* The "clockTick1" counts the number of times the code of this task has
     * been executed. The resolution of this integer timer is 0.001, which is the step size
     * of the task. Size of "clockTick1" ensures timer will not overflow during the
     * application lifespan selected.
     * Timer of this task consists of two 32 bit unsigned integers.
     * The two integers represent the low bits Timing.clockTick1 and the high bits
     * Timing.clockTickH1. When the low bit overflows to 0, the high bits increment.
     */
    F28379D_IPC_CPU2_2020a_M->Timing.clockTick1++;
    if (!F28379D_IPC_CPU2_2020a_M->Timing.clockTick1) {
      F28379D_IPC_CPU2_2020a_M->Timing.clockTickH1++;
    }
  }                                    /* end MajorTimeStep */
}

/* Derivatives for root system: '<Root>' */
void F28379D_IPC_CPU2_2020a_derivatives(void)
{
  StateDerivatives_F28379D_IPC_CP *_rtXdot;
  _rtXdot = ((StateDerivatives_F28379D_IPC_CP *)
             F28379D_IPC_CPU2_2020a_M->derivs);

