JamieZhang97/ILLI-Racecar/Simulink/Lateral Controller/CCS_Simulink/F28379D_IPC_CPU2_2020a_ert_rtw/F28379D_IPC_CPU2_2020a.c
  /* Derivatives for Integrator: '<S3>/Integrator' */
  _rtXdot->Integrator_CSTATE = F28379D_IPC_CPU2_2020a_B.DataTypeConversion;
}

/* Model step function for TID2 */
void F28379D_IPC_CPU2_2020a_step2(void) /* Sample time: [0.005s, 0.0s] */
{
  real_T i;
  real32_T x_t;
  real32_T y_t;
  int16_T tmp;
  int32_T exitg1;

  /* S-Function (c280xcanrcv): '<Root>/CAN External Receive' */
  {
    tCANMsgObject sRXCANMessage;
    unsigned char ucRXMsgData[8] = { 0, 0, 0, 0, 0, 0, 0, 0 };

    sRXCANMessage.ui32MsgID = 1;       // CAN message ID
    sRXCANMessage.ui32MsgIDMask = 0;   // no mask needed for TX
    sRXCANMessage.ui32Flags = MSG_OBJ_NO_FLAGS;
    sRXCANMessage.ui32MsgLen = sizeof(ucRXMsgData);// size of message
    sRXCANMessage.pucMsgData = ucRXMsgData;// ptr to message content

    // Get the receive message
    CANMessageGet(CANB_BASE, 1, &sRXCANMessage, false);
    if (sRXCANMessage.ui32MsgLen > 0) {
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Extended = 0;
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Length =
        sRXCANMessage.ui32MsgLen;
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.ID = 1;
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[0] = ucRXMsgData[0];
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[1] = ucRXMsgData[1];
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[2] = ucRXMsgData[2];
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[3] = ucRXMsgData[3];
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[4] = ucRXMsgData[4];
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[5] = ucRXMsgData[5];
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[6] = ucRXMsgData[6];
      F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[7] = ucRXMsgData[7];

      /* -- Call CAN RX Fcn-Call_0 -- */

      /* Output and update for function-call system: '<Root>/Msg Converter' */

      /* S-Function (scanunpack): '<S2>/CAN Unpack1' */
      {
        /* S-Function (scanunpack): '<S2>/CAN Unpack1' */
        uint8_T msgReceived = 0;
        if ((8 == F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Length) &&
            (F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.ID != INVALID_CAN_ID)
            ) {
          if ((1 == F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.ID) && (0U ==
               F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Extended) ) {
            msgReceived = 1;

            {
              /* --------------- START Unpacking signal 0 ------------------
               *  startBit                = 0
               *  length                  = 8
               *  desiredSignalByteLayout = LITTLEENDIAN
               *  dataType                = UNSIGNED
               *  factor                  = 1.0
               *  offset                  = 0.0
               * -----------------------------------------------------------------------*/
              {
                real64_T outValue = 0;

                {
                  uint8_T unpackedValue = 0;

                  {
                    uint8_T tempValue = (uint8_T) (0);

                    {
                      tempValue = tempValue | (uint8_T)
                        (F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[0]);
                    }

                    unpackedValue = tempValue;
                  }

                  outValue = (real64_T) (unpackedValue);
                }

                {
                  real64_T result = (real64_T) outValue;
                  F28379D_IPC_CPU2_2020a_B.CANUnpack1_o1 = result;
                }
              }

              /* --------------- START Unpacking signal 1 ------------------
               *  startBit                = 8
               *  length                  = 8
               *  desiredSignalByteLayout = LITTLEENDIAN
               *  dataType                = UNSIGNED
               *  factor                  = 1.0
               *  offset                  = 0.0
               * -----------------------------------------------------------------------*/
              {
                real64_T outValue = 0;

                {
                  uint8_T unpackedValue = 0;

                  {
                    uint8_T tempValue = (uint8_T) (0);

                    {
                      tempValue = tempValue | (uint8_T)
                        (F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[1]);
                    }

                    unpackedValue = tempValue;
                  }

                  outValue = (real64_T) (unpackedValue);
                }

                {
                  real64_T result = (real64_T) outValue;
                  F28379D_IPC_CPU2_2020a_B.CANUnpack1_o2 = result;
                }
              }

              /* --------------- START Unpacking signal 2 ------------------
               *  startBit                = 16
               *  length                  = 8
               *  desiredSignalByteLayout = LITTLEENDIAN
               *  dataType                = UNSIGNED
               *  factor                  = 1.0
               *  offset                  = 0.0
               * -----------------------------------------------------------------------*/
              {
                real64_T outValue = 0;

                {
                  uint8_T unpackedValue = 0;

                  {
                    uint8_T tempValue = (uint8_T) (0);

                    {
                      tempValue = tempValue | (uint8_T)
                        (F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[2]);
                    }

                    unpackedValue = tempValue;
                  }

                  outValue = (real64_T) (unpackedValue);
                }

                {
                  real64_T result = (real64_T) outValue;
                  F28379D_IPC_CPU2_2020a_B.CANUnpack1_o3 = result;
                }
              }

              /* --------------- START Unpacking signal 3 ------------------
               *  startBit                = 24
               *  length                  = 8
               *  desiredSignalByteLayout = LITTLEENDIAN
               *  dataType                = UNSIGNED
               *  factor                  = 1.0
               *  offset                  = 0.0
               * -----------------------------------------------------------------------*/
              {
                real64_T outValue = 0;

                {
                  uint8_T unpackedValue = 0;

                  {
                    uint8_T tempValue = (uint8_T) (0);

                    {
                      tempValue = tempValue | (uint8_T)
                        (F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[3]);
                    }

                    unpackedValue = tempValue;
                  }

                  outValue = (real64_T) (unpackedValue);
                }

                {
                  real64_T result = (real64_T) outValue;
                  F28379D_IPC_CPU2_2020a_B.CANUnpack1_o4 = result;
                }
              }

              /* --------------- START Unpacking signal 4 ------------------
               *  startBit                = 32
               *  length                  = 8
               *  desiredSignalByteLayout = LITTLEENDIAN
               *  dataType                = UNSIGNED
               *  factor                  = 1.0
               *  offset                  = 0.0
               * -----------------------------------------------------------------------*/
              {
                real64_T outValue = 0;

                {
                  uint8_T unpackedValue = 0;

                  {
                    uint8_T tempValue = (uint8_T) (0);

                    {
                      tempValue = tempValue | (uint8_T)
                        (F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[4]);
                    }

                    unpackedValue = tempValue;
                  }

                  outValue = (real64_T) (unpackedValue);
                }

                {
                  real64_T result = (real64_T) outValue;
                  F28379D_IPC_CPU2_2020a_B.CANUnpack1_o5 = result;
                }
              }

              /* --------------- START Unpacking signal 5 ------------------
               *  startBit                = 40
               *  length                  = 8
               *  desiredSignalByteLayout = LITTLEENDIAN
               *  dataType                = UNSIGNED
               *  factor                  = 1.0
               *  offset                  = 0.0
               * -----------------------------------------------------------------------*/
              {
                real64_T outValue = 0;

                {
                  uint8_T unpackedValue = 0;

                  {
                    uint8_T tempValue = (uint8_T) (0);

                    {
                      tempValue = tempValue | (uint8_T)
                        (F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[5]);
                    }

                    unpackedValue = tempValue;
                  }

                  outValue = (real64_T) (unpackedValue);
                }

                {
                  real64_T result = (real64_T) outValue;
                  F28379D_IPC_CPU2_2020a_B.CANUnpack1_o6 = result;
                }
              }

              /* --------------- START Unpacking signal 6 ------------------
               *  startBit                = 48
               *  length                  = 8
               *  desiredSignalByteLayout = LITTLEENDIAN
               *  dataType                = UNSIGNED
               *  factor                  = 1.0
               *  offset                  = 0.0
               * -----------------------------------------------------------------------*/
              {
                real64_T outValue = 0;

                {
                  uint8_T unpackedValue = 0;

                  {
                    uint8_T tempValue = (uint8_T) (0);

                    {
                      tempValue = tempValue | (uint8_T)
                        (F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[6]);
                    }

                    unpackedValue = tempValue;
                  }

                  outValue = (real64_T) (unpackedValue);
                }

                {
                  real64_T result = (real64_T) outValue;
                  F28379D_IPC_CPU2_2020a_B.CANUnpack1_o7 = result;
                }
              }

              /* --------------- START Unpacking signal 7 ------------------
               *  startBit                = 56
               *  length                  = 8
               *  desiredSignalByteLayout = LITTLEENDIAN
               *  dataType                = UNSIGNED
               *  factor                  = 1.0
               *  offset                  = 0.0
               * -----------------------------------------------------------------------*/
              {
                real64_T outValue = 0;

                {
                  uint8_T unpackedValue = 0;

                  {
                    uint8_T tempValue = (uint8_T) (0);

                    {
                      tempValue = tempValue | (uint8_T)
                        (F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[7]);
                    }

                    unpackedValue = tempValue;
                  }

                  outValue = (real64_T) (unpackedValue);
                }

                {
                  real64_T result = (real64_T) outValue;
                  F28379D_IPC_CPU2_2020a_B.CANUnpack1_o8 = result;
                }
              }
            }

