JamieZhang97/ILLI-Racecar/Simulink/Lateral Controller/CCS_Simulink/F28379D_IPC_CPU2_2020a_ert_rtw/F28379D_IPC_CPU2_2020a.c
            /* Extract the length */
            F28379D_IPC_CPU2_2020a_B.CANUnpack1_o9 =
              F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Length;
          }
        }

        /* Status port */
        F28379D_IPC_CPU2_2020a_B.CANUnpack1_o10 = msgReceived;
      }

      /* DataTypeConversion: '<S2>/Data Type Conversion' */
      F28379D_IPC_CPU2_2020a_B.DataTypeConversion_h = (uint16_T)
        F28379D_IPC_CPU2_2020a_B.CANUnpack1_o1 & 255U;

      /* DataTypeConversion: '<S2>/Data Type Conversion1' */
      F28379D_IPC_CPU2_2020a_B.DataTypeConversion1 = (uint16_T)
        F28379D_IPC_CPU2_2020a_B.CANUnpack1_o2 & 255U;

      /* DataTypeConversion: '<S2>/Data Type Conversion2' */
      F28379D_IPC_CPU2_2020a_B.DataTypeConversion2 = (uint16_T)
        F28379D_IPC_CPU2_2020a_B.CANUnpack1_o3 & 255U;

      /* DataTypeConversion: '<S2>/Data Type Conversion3' */
      F28379D_IPC_CPU2_2020a_B.DataTypeConversion3 = (uint16_T)
        F28379D_IPC_CPU2_2020a_B.CANUnpack1_o4 & 255U;

      /* DataTypeConversion: '<S2>/Data Type Conversion4' */
      F28379D_IPC_CPU2_2020a_B.DataTypeConversion4 = (uint16_T)
        F28379D_IPC_CPU2_2020a_B.CANUnpack1_o5 & 255U;

      /* DataTypeConversion: '<S2>/Data Type Conversion5' */
      F28379D_IPC_CPU2_2020a_B.DataTypeConversion5 = (uint16_T)
        F28379D_IPC_CPU2_2020a_B.CANUnpack1_o6 & 255U;

      /* DataTypeConversion: '<S2>/Data Type Conversion6' */
      F28379D_IPC_CPU2_2020a_B.DataTypeConversion6 = (uint16_T)
        F28379D_IPC_CPU2_2020a_B.CANUnpack1_o7 & 255U;

      /* DataTypeConversion: '<S2>/Data Type Conversion7' */
      F28379D_IPC_CPU2_2020a_B.DataTypeConversion7 = (uint16_T)
        F28379D_IPC_CPU2_2020a_B.CANUnpack1_o8 & 255U;
    }
  }

  /* End of Outputs for S-Function (c280xcanrcv): '<Root>/CAN External Receive' */

  /* MATLAB Function: '<Root>/u2f_1' */
  uint16Tofloat16(F28379D_IPC_CPU2_2020a_B.DataTypeConversion_h,
                  F28379D_IPC_CPU2_2020a_B.DataTypeConversion1,
                  &F28379D_IPC_CPU2_2020a_B.sf_u2f_1);

  /* MATLAB Function: '<Root>/u2f_2' */
  uint16Tofloat16(F28379D_IPC_CPU2_2020a_B.DataTypeConversion2,
                  F28379D_IPC_CPU2_2020a_B.DataTypeConversion3,
                  &F28379D_IPC_CPU2_2020a_B.sf_u2f_2);

  /* MATLAB Function: '<Root>/u2f_3' */
  uint16Tofloat16(F28379D_IPC_CPU2_2020a_B.DataTypeConversion4,
                  F28379D_IPC_CPU2_2020a_B.DataTypeConversion5,
                  &F28379D_IPC_CPU2_2020a_B.sf_u2f_3);

  /* MATLAB Function: '<Root>/u2f_4' */
  uint16Tofloat16(F28379D_IPC_CPU2_2020a_B.DataTypeConversion6,
                  F28379D_IPC_CPU2_2020a_B.DataTypeConversion7,
                  &F28379D_IPC_CPU2_2020a_B.sf_u2f_4);

  /* MATLAB Function: '<Root>/list parameter in an array' */
  /* MATLAB Function 'list parameter in an array': '<S5>:1' */
  /* '<S5>:1:3' */
  F28379D_IPC_CPU2_2020a_B.output_array_e[0] =
    F28379D_IPC_CPU2_2020a_B.sf_u2f_1.result;
  F28379D_IPC_CPU2_2020a_B.output_array_e[1] =
    F28379D_IPC_CPU2_2020a_B.sf_u2f_2.result;
  F28379D_IPC_CPU2_2020a_B.output_array_e[2] =
    F28379D_IPC_CPU2_2020a_B.sf_u2f_3.result;
  F28379D_IPC_CPU2_2020a_B.output_array_e[3] =
    F28379D_IPC_CPU2_2020a_B.sf_u2f_4.result;

  /* MATLAB Function: '<Root>/find look-ahead points' */
  /* MATLAB Function 'find look-ahead points': '<S4>:1' */
  /* '<S4>:1:3' */
  i = 0.0;
  do {
    exitg1 = 0L;

    /* '<S4>:1:6' */
    x_t = F28379D_IPC_CPU2_2020a_P.lookaheaddistance_Value - (real32_T)i;

    /* '<S4>:1:7' */
    y_t = ((x_t * x_t * F28379D_IPC_CPU2_2020a_B.output_array_e[2] +
            F28379D_IPC_CPU2_2020a_B.output_array_e[3] * rt_powf_snf(x_t, 3.0F))
           + F28379D_IPC_CPU2_2020a_B.output_array_e[1] * x_t) +
      F28379D_IPC_CPU2_2020a_B.output_array_e[0];

    /* '<S4>:1:9' */
    if (x_t <= 0.01) {
      /* '<S4>:1:10' */
      /* '<S4>:1:11' */
      F28379D_IPC_CPU2_2020a_B.x_lh =
        F28379D_IPC_CPU2_2020a_P.lookaheaddistance_Value;

      /* '<S4>:1:12' */
      F28379D_IPC_CPU2_2020a_B.y_lh = 0.0F;
      exitg1 = 1L;
    } else if (fabsf((real32_T)sqrt(x_t * x_t + y_t * y_t) -
                     F28379D_IPC_CPU2_2020a_P.lookaheaddistance_Value) <= 0.01)
    {
      /* '<S4>:1:15' */
      /* '<S4>:1:16' */
      F28379D_IPC_CPU2_2020a_B.x_lh = x_t;

      /* '<S4>:1:17' */
      F28379D_IPC_CPU2_2020a_B.y_lh = y_t;
      exitg1 = 1L;
    } else {
      /* '<S4>:1:20' */
      i += 0.01;
    }
  } while (exitg1 == 0L);

  /* RateTransition generated from: '<S6>/Subtract' */
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_semapho =
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_ActiveB;
  tmp = F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_semapho << 1U;
  F28379D_IPC_CPU2_2020a_B.TmpRTBAtSubtractInport2[0] =
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer[tmp];
  F28379D_IPC_CPU2_2020a_B.TmpRTBAtSubtractInport2[1] =
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer[tmp + 1];

  /* Sum: '<S6>/Subtract' */
  F28379D_IPC_CPU2_2020a_B.Subtract_l[0] = F28379D_IPC_CPU2_2020a_B.x_lh -
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtSubtractInport2[0];
  F28379D_IPC_CPU2_2020a_B.Subtract_l[1] = F28379D_IPC_CPU2_2020a_B.y_lh -
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtSubtractInport2[1];

  /* Trigonometry: '<S6>/Atan2' */
  F28379D_IPC_CPU2_2020a_B.Atan2 = rt_atan2f_snf
    (F28379D_IPC_CPU2_2020a_B.Subtract_l[1],
     F28379D_IPC_CPU2_2020a_B.Subtract_l[0]);

  /* RateTransition generated from: '<S6>/heading error in [-pi,pi]' */
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInp_p =
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInp_b;
  F28379D_IPC_CPU2_2020a_B.TmpRTBAtheadingerrorinpipiInpor =
    F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInpor[F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInp_p];

  /* MATLAB Function: '<S6>/heading error in [-pi,pi]' */
  /* MATLAB Function 'pure pursuit lateral controller/heading error in [-pi,pi]': '<S12>:1' */
  /* '<S12>:1:2' */
  for (x_t = F28379D_IPC_CPU2_2020a_B.Atan2 -
       F28379D_IPC_CPU2_2020a_B.TmpRTBAtheadingerrorinpipiInpor; x_t >
       3.1415926535897931; x_t -= 6.28318548F) {
    /* '<S12>:1:3' */
    /* '<S12>:1:4' */
  }

