JamieZhang97/ILLI-Racecar/Simulink/Lateral Controller/CCS_Simulink/F28379D_IPC_CPU2_2020a_ert_rtw/F28379D_IPC_CPU2_2020a.c
  while (x_t < -3.1415926535897931) {
    /* '<S12>:1:7' */
    /* '<S12>:1:8' */
    x_t += 6.28318548F;
  }

  /* '<S12>:1:10' */
  F28379D_IPC_CPU2_2020a_B.y = x_t;

  /* End of MATLAB Function: '<S6>/heading error in [-pi,pi]' */

  /* Gain: '<S6>/Gain' */
  F28379D_IPC_CPU2_2020a_B.Gain = F28379D_IPC_CPU2_2020a_P.Gain_Gain *
    F28379D_IPC_CPU2_2020a_B.y;

  /* RateTransition generated from: '<Root>/single_array1' */
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtsingle_array1Inport2_Bu =
    F28379D_IPC_CPU2_2020a_B.Gain;
}

/* Model initialize function */
void F28379D_IPC_CPU2_2020a_initialize(void)
{
  /* Registration code */

  /* initialize non-finites */
  rt_InitInfAndNaN(sizeof(real_T));

  /* initialize real-time model */
  (void) memset((void *)F28379D_IPC_CPU2_2020a_M, 0,
                sizeof(RT_MODEL_F28379D_IPC_CPU2_2020a));

  {
    /* Setup solver object */
    rtsiSetSimTimeStepPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo,
                          &F28379D_IPC_CPU2_2020a_M->Timing.simTimeStep);
    rtsiSetTPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo, &rtmGetTPtr
                (F28379D_IPC_CPU2_2020a_M));
    rtsiSetStepSizePtr(&F28379D_IPC_CPU2_2020a_M->solverInfo,
                       &F28379D_IPC_CPU2_2020a_M->Timing.stepSize0);
    rtsiSetdXPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo,
                 &F28379D_IPC_CPU2_2020a_M->derivs);
    rtsiSetContStatesPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo, (real_T **)
                         &F28379D_IPC_CPU2_2020a_M->contStates);
    rtsiSetNumContStatesPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo,
      &F28379D_IPC_CPU2_2020a_M->Sizes.numContStates);
    rtsiSetNumPeriodicContStatesPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo,
      &F28379D_IPC_CPU2_2020a_M->Sizes.numPeriodicContStates);
    rtsiSetPeriodicContStateIndicesPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo,
      &F28379D_IPC_CPU2_2020a_M->periodicContStateIndices);
    rtsiSetPeriodicContStateRangesPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo,
      &F28379D_IPC_CPU2_2020a_M->periodicContStateRanges);
    rtsiSetErrorStatusPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo,
                          (&rtmGetErrorStatus(F28379D_IPC_CPU2_2020a_M)));
    rtsiSetRTModelPtr(&F28379D_IPC_CPU2_2020a_M->solverInfo,
                      F28379D_IPC_CPU2_2020a_M);
  }

  rtsiSetSimTimeStep(&F28379D_IPC_CPU2_2020a_M->solverInfo, MAJOR_TIME_STEP);
  F28379D_IPC_CPU2_2020a_M->intgData.y = F28379D_IPC_CPU2_2020a_M->odeY;
  F28379D_IPC_CPU2_2020a_M->intgData.f[0] = F28379D_IPC_CPU2_2020a_M->odeF[0];
  F28379D_IPC_CPU2_2020a_M->intgData.f[1] = F28379D_IPC_CPU2_2020a_M->odeF[1];
  F28379D_IPC_CPU2_2020a_M->intgData.f[2] = F28379D_IPC_CPU2_2020a_M->odeF[2];
  F28379D_IPC_CPU2_2020a_M->contStates = ((ContinuousStates_F28379D_IPC_CP *)
    &F28379D_IPC_CPU2_2020a_X);
  rtsiSetSolverData(&F28379D_IPC_CPU2_2020a_M->solverInfo, (void *)
                    &F28379D_IPC_CPU2_2020a_M->intgData);
  rtsiSetSolverName(&F28379D_IPC_CPU2_2020a_M->solverInfo,"ode3");
  rtmSetTPtr(F28379D_IPC_CPU2_2020a_M, &F28379D_IPC_CPU2_2020a_M->Timing.tArray
             [0]);
  F28379D_IPC_CPU2_2020a_M->Timing.stepSize0 = 0.001;

  /* block I/O */
  (void) memset(((void *) &F28379D_IPC_CPU2_2020a_B), 0,
                sizeof(BlockIO_F28379D_IPC_CPU2_2020a));

  {
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2 = CAN_DATATYPE_GROUND;
    F28379D_IPC_CPU2_2020a_B.Integrator = 0.0;
    F28379D_IPC_CPU2_2020a_B.DataTypeConversion = 0.0;
    F28379D_IPC_CPU2_2020a_B.CANUnpack1_o1 = 0.0;
    F28379D_IPC_CPU2_2020a_B.CANUnpack1_o2 = 0.0;
    F28379D_IPC_CPU2_2020a_B.CANUnpack1_o3 = 0.0;
    F28379D_IPC_CPU2_2020a_B.CANUnpack1_o4 = 0.0;
    F28379D_IPC_CPU2_2020a_B.CANUnpack1_o5 = 0.0;
    F28379D_IPC_CPU2_2020a_B.CANUnpack1_o6 = 0.0;
    F28379D_IPC_CPU2_2020a_B.CANUnpack1_o7 = 0.0;
    F28379D_IPC_CPU2_2020a_B.CANUnpack1_o8 = 0.0;
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtSubtractInport1 = 0.0F;
    F28379D_IPC_CPU2_2020a_B.Subtract = 0.0F;
    F28379D_IPC_CPU2_2020a_B.Kp = 0.0F;
    F28379D_IPC_CPU2_2020a_B.Ki = 0.0F;
    F28379D_IPC_CPU2_2020a_B.Subtract1 = 0.0F;
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtsingle_array1Inport2 = 0.0F;
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtSubtractInport2[0] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtSubtractInport2[1] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.Subtract_l[0] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.Subtract_l[1] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.Atan2 = 0.0F;
    F28379D_IPC_CPU2_2020a_B.TmpRTBAtheadingerrorinpipiInpor = 0.0F;
    F28379D_IPC_CPU2_2020a_B.Gain = 0.0F;
    F28379D_IPC_CPU2_2020a_B.output_array[0] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.output_array[1] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.output_array[2] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.output_array[3] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.y = 0.0F;
    F28379D_IPC_CPU2_2020a_B.output_array_e[0] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.output_array_e[1] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.output_array_e[2] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.output_array_e[3] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.x_lh = 0.0F;
    F28379D_IPC_CPU2_2020a_B.y_lh = 0.0F;
    F28379D_IPC_CPU2_2020a_B.IPCReceive1_o1[0] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.IPCReceive1_o1[1] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.IPCReceive1_o1[2] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.IPCReceive1_o1[3] = 0.0F;
    F28379D_IPC_CPU2_2020a_B.sf_u2f_4.result = 0.0F;
    F28379D_IPC_CPU2_2020a_B.sf_u2f_3.result = 0.0F;
    F28379D_IPC_CPU2_2020a_B.sf_u2f_2.result = 0.0F;
    F28379D_IPC_CPU2_2020a_B.sf_u2f_1.result = 0.0F;
  }

  /* states (continuous) */
  {
    (void) memset((void *)&F28379D_IPC_CPU2_2020a_X, 0,
                  sizeof(ContinuousStates_F28379D_IPC_CP));
  }

  /* states (dwork) */
  (void) memset((void *)&F28379D_IPC_CPU2_2020a_DWork, 0,
                sizeof(D_Work_F28379D_IPC_CPU2_2020a));
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_Buffer[0] = 0.0F;
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_Buffer[1] = 0.0F;
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtsingle_array1Inport2_Bu = 0.0F;
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer[0] = 0.0F;
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer[1] = 0.0F;
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer[2] = 0.0F;
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer[3] = 0.0F;
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInpor[0] = 0.0F;
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInpor[1] = 0.0F;

