JamieZhang97/ILLI-Racecar/Simulink/Lateral Controller/CCS_Simulink/F28379D_IPC_CPU2_2020a_ert_rtw/F28379D_IPC_CPU2_2020a.c
  /* Start for S-Function (c28xisr_c2000): '<Root>/IPC Interrupt' incorporates:
   *  SubSystem: '<Root>/IPC 1'
   */

  /* Start for function-call system: '<Root>/IPC 1' */

  /* Start for S-Function (c28xipc_rx): '<S1>/IPC Receive1' */
  IPCInit(CHANNEL1, 4, 0);

  /* End of Start for S-Function (c28xisr_c2000): '<Root>/IPC Interrupt' */

  /* Start for RateTransition generated from: '<Root>/single_array1' */
  F28379D_IPC_CPU2_2020a_B.TmpRTBAtsingle_array1Inport2 =
    F28379D_IPC_CPU2_2020a_P.TmpRTBAtsingle_array1Inport2_In;

  /* Start for S-Function (c28xipc_tx): '<Root>/IPC Transmit 1' */
  IPCInit(CHANNEL1, 4, 0);

  /* Start for S-Function (c280xcanrcv): '<Root>/CAN External Receive' incorporates:
   *  SubSystem: '<Root>/Msg Converter'
   */

  /* Start for function-call system: '<Root>/Msg Converter' */

  /* Start for S-Function (scanunpack): '<S2>/CAN Unpack1' */

  /*-----------S-Function Block: <S2>/CAN Unpack1 -----------------*/
  {
    tCANMsgObject sRXCANMessage;
    unsigned char ucRXMsgData[8]= { 0, 0, 0, 0, 0, 0, 0, 0 };

    sRXCANMessage.ui32MsgID = 1;       // CAN message ID
    sRXCANMessage.ui32MsgIDMask = 0;   // no mask needed for TX
    sRXCANMessage.ui32Flags = MSG_OBJ_NO_FLAGS;
    sRXCANMessage.ui32MsgLen = sizeof(ucRXMsgData);// size of message is 4
    sRXCANMessage.pucMsgData = ucRXMsgData;// ptr to message content

    // Setup the message object being used to receive messages
    CANMessageSet(CANB_BASE, 1, &sRXCANMessage, MSG_OBJ_TYPE_RX);
  }

  /* Initialize F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2 */
  {
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Extended = 0;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Length = 8;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.ID = 1;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[0] = (uint8_T)0.0;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[1] = (uint8_T)0.0;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[2] = (uint8_T)0.0;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[3] = (uint8_T)0.0;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[4] = (uint8_T)0.0;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[5] = (uint8_T)0.0;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[6] = (uint8_T)0.0;
    F28379D_IPC_CPU2_2020a_B.CANExternalReceive_o2.Data[7] = (uint8_T)0.0;
  }

  /* End of Start for S-Function (c280xcanrcv): '<Root>/CAN External Receive' */

  /* InitializeConditions for RateTransition generated from: '<S3>/Subtract' */
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport1_Buffer[0] =
    F28379D_IPC_CPU2_2020a_P.TmpRTBAtSubtractInport1_Initial;

  /* InitializeConditions for Integrator: '<S3>/Integrator' */
  F28379D_IPC_CPU2_2020a_X.Integrator_CSTATE =
    F28379D_IPC_CPU2_2020a_P.Integrator_IC;

  /* InitializeConditions for RateTransition generated from: '<Root>/single_array1' */
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtsingle_array1Inport2_Bu =
    F28379D_IPC_CPU2_2020a_P.TmpRTBAtsingle_array1Inport2_In;

  /* InitializeConditions for RateTransition generated from: '<S6>/Subtract' */
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer[0] =
    F28379D_IPC_CPU2_2020a_P.TmpRTBAtSubtractInport2_Initial;
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtSubtractInport2_Buffer[1] =
    F28379D_IPC_CPU2_2020a_P.TmpRTBAtSubtractInport2_Initial;

  /* InitializeConditions for RateTransition generated from: '<S6>/heading error in [-pi,pi]' */
  F28379D_IPC_CPU2_2020a_DWork.TmpRTBAtheadingerrorinpipiInpor[0] =
    F28379D_IPC_CPU2_2020a_P.TmpRTBAtheadingerrorinpipiInpor;
}

/* Model terminate function */
void F28379D_IPC_CPU2_2020a_terminate(void)
{
  /* (no terminate code required) */
}

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
